zephyrproject-rtos/zephyr/soc/nxp/lpc/lpc54xxx/soc.h
/*
 * Copyright 2017, 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief Board configuration macros for the nxp_lpc54114 platform
 *
 * This header file is used to specify and describe board-level aspects for the
 * 'nxp_lpc54114' platform.
 */

#ifndef _SOC__H_
#define _SOC__H_

#ifndef _ASMLANGUAGE
#include <zephyr/sys/util.h>
#include <fsl_common.h>
#include <soc_common.h>

#endif /* !_ASMLANGUAGE */

#define IOCON_PIO_DIGITAL_EN	IOCON_PIO_DIGIMODE(0x1)
#define IOCON_PIO_FUNC0		0x00u
#define IOCON_PIO_FUNC1		0x01u
#define IOCON_PIO_FUNC2		0x02u
#define IOCON_PIO_FUNC3		0x03u
#define IOCON_PIO_FUNC4		0x04u
#define IOCON_PIO_I2CDRIVE_LOW	0x00u
#define IOCON_PIO_I2CFILTER_EN	0x00u
#define IOCON_PIO_I2CSLEW_I2C	0x00u
#define IOCON_PIO_INPFILT_OFF	IOCON_PIO_FILTEROFF(0x1)
#define IOCON_PIO_INV_DI	0x00u
#define IOCON_PIO_MODE_INACT	0x00u
#define IOCON_PIO_OPENDRAIN_DI	0x00u
#define IOCON_PIO_SLEW_STANDARD	0x00u
#define IOCON_PIO_MODE_PULLUP	IOCON_PIO_MODE(0x2)
#define IOCON_PIO_MODE_PULLDOWN	IOCON_PIO_MODE(0x1)

/* Handle variation to implement Wakeup Interrupt */
#undef NXP_ENABLE_WAKEUP_SIGNAL
#undef NXP_DISABLE_WAKEUP_SIGNAL
#define NXP_ENABLE_WAKEUP_SIGNAL(irqn) EnableDeepSleepIRQ(irqn)
#define NXP_DISABLE_WAKEUP_SIGNAL(irqn) DisableDeepSleepIRQ(irqn)

#endif /* _SOC__H_ */
